; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-4-2-8-8-4) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 distributor3 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate3)
	(at pallet3 depot3)
	(clear crate0)
	(at pallet4 distributor0)
	(clear pallet4)
	(at pallet5 distributor1)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor3)
	(clear crate2)
	(at truck0 distributor2)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 distributor3)
	(available hoist7)
	(at crate0 depot3)
	(on crate0 pallet3)
	(at crate1 distributor3)
	(on crate1 pallet7)
	(at crate2 distributor3)
	(on crate2 crate1)
	(at crate3 depot2)
	(on crate3 pallet2)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet6)
		(on crate2 pallet3)
		(on crate3 pallet5)
	)
))

; plan
1. (lift hoist7 crate2 crate1 distributor3)
   deleted: (at crate2 distributor3) (available hoist7) (on crate2 crate1) (clear crate2)
   added: (lifting hoist7 crate2) (clear crate1)
   goals met: 0 of 4
2. (drive truck0 distributor2 distributor3)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor3)
   goals met: 0 of 4
3. (load hoist7 crate2 truck0 distributor3)
   deleted: (lifting hoist7 crate2)
   added: (in crate2 truck0) (available hoist7)
   goals met: 0 of 4
4. (lift hoist7 crate1 pallet7 distributor3)
   deleted: (at crate1 distributor3) (available hoist7) (on crate1 pallet7) (clear crate1)
   added: (lifting hoist7 crate1) (clear pallet7)
   goals met: 0 of 4
5. (load hoist7 crate1 truck0 distributor3)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   goals met: 0 of 4
6. (lift hoist3 crate0 pallet3 depot3)
   deleted: (at crate0 depot3) (available hoist3) (on crate0 pallet3) (clear crate0)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 4
7. (drive truck0 distributor3 depot3)
   deleted: (at truck0 distributor3)
   added: (at truck0 depot3)
   goals met: 0 of 4
8. (load hoist3 crate0 truck0 depot3)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 0 of 4
9. (unload hoist3 crate2 truck0 depot3)
   deleted: (available hoist3) (in crate2 truck0)
   added: (lifting hoist3 crate2)
   goals met: 0 of 4
10. (drive truck0 depot3 depot0)
   deleted: (at truck0 depot3)
   added: (at truck0 depot0)
   goals met: 0 of 4
11. (unload hoist0 crate0 truck0 depot0)
   deleted: (available hoist0) (in crate0 truck0)
   added: (lifting hoist0 crate0)
   goals met: 0 of 4
12. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   goals met: 1 of 4
13. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 4
14. (drop hoist3 crate2 pallet3 depot3)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (at crate2 depot3) (available hoist3) (on crate2 pallet3) (clear crate2)
   goals met: 2 of 4
15. (lift hoist2 crate3 pallet2 depot2)
   deleted: (at crate3 depot2) (available hoist2) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist2 crate3) (clear pallet2)
   goals met: 2 of 4
16. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   goals met: 2 of 4
17. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 2 of 4
18. (unload hoist5 crate3 truck0 distributor1)
   deleted: (available hoist5) (in crate3 truck0)
   added: (lifting hoist5 crate3)
   goals met: 2 of 4
19. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 2 of 4
20. (drop hoist5 crate3 pallet5 distributor1)
   deleted: (lifting hoist5 crate3) (clear pallet5)
   added: (at crate3 distributor1) (available hoist5) (on crate3 pallet5) (clear crate3)
   goals met: 3 of 4
21. (unload hoist6 crate1 truck0 distributor2)
   deleted: (available hoist6) (in crate1 truck0)
   added: (lifting hoist6 crate1)
   goals met: 3 of 4
22. (drop hoist6 crate1 pallet6 distributor2)
   deleted: (lifting hoist6 crate1) (clear pallet6)
   added: (at crate1 distributor2) (available hoist6) (on crate1 pallet6) (clear crate1)
   goals met: 4 of 4
